In [1]:
import pandas as pd

In [2]:
# merging ot concateating datasets

In [3]:
import pandas as pd

In [4]:
staff=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"hari","role":"pr"},
    {"name":"sr","role":"pune"}
])

In [5]:
staff

    name  role
0  gokul    hr
1   hari    pr
2     sr  pune

In [6]:
staff=staff.set_index('name')
student=student.set_index('name')

In [7]:
staff

       role
name
gokul    hr
hari     pr
sr     pune

In [8]:
student=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"sjsjsjj","role":"prlsls"},
    {"name":"sraa","role":"klklkl"}
])

In [9]:
student=student.set_index('name')

In [10]:
student

           role
name
gokul        hr
sjsjsjj  prlsls
sraa     klklkl

In [11]:
pd.merge(staff,student,how="outer",left_index=True,right_index=True)#full outer join in similiar to union

        role_x  role_y
name
gokul       hr      hr
hari        pr     NaN
sjsjsjj    NaN  prlsls
sr        pune     NaN
sraa       NaN  klklkl

In [12]:
# now we want to get th e intersection set the how attribute to inner
pd.merge(staff,student,how="inner",left_index=True,right_index=True)#full outer join in similiar to union

      role_x role_y
name
gokul     hr     hr

In [13]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [14]:
x=obj2['California']
obj2['California']==x

False

In [15]:
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)

In [16]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [17]:
df=staff.copy()

In [18]:
df=df.reset_index()
df.columns

Index(['name', 'role'], dtype='object')

In [23]:
df=df.rename(mapper=lambda x: x.upper(),axis="columns" )
df

    NAME  ROLE
0  gokul    hr
1   hari    pr
2     sr  pune

In [30]:
df['score']=[10,20,1010]

In [31]:
df

    NAME  ROLE  score
0  gokul    hr     10
1   hari    pr     20
2     sr  pune   1010

In [33]:
df[df['score']>10]

   NAME  ROLE  score
1  hari    pr     20
2    sr  pune   1010

In [36]:
df.where(df['score']>10)

   NAME  ROLE   score
0   NaN   NaN     NaN
1  hari    pr    20.0
2    sr  pune  1010.0

In [39]:
df.drop('score',axis=1)
df

    NAME  ROLE  score
0  gokul    hr     10
1   hari    pr     20
2     sr  pune   1010

In [47]:
df=df.set_index('NAME')

KeyError: "None of ['NAME'] are in the columns"

In [48]:
df

       ROLE  score
NAME
gokul    hr     10
hari     pr     20
sr     pune   1010

In [52]:
df.drop(['gokul','hari'])

      ROLE  score
NAME
sr    pune   1010

In [54]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [55]:
df

       ROLE  score
NAME
gokul    hr     10
hari     pr     20
sr     pune   1010

In [62]:
df.T['gokul']

ROLE     hr
score    10
Name: gokul, dtype: object

In [66]:
score=pd.DataFrame(
)

In [67]:
score

          tofel score
gre score         NaN

In [68]:
s2

Alice    1
Jack     2
Molly    3
dtype: int64

In [71]:
for i in s2.iteritems():
    print(i)

('Alice', 1)
('Jack', 2)
('Molly', 3)

In [72]:
s1

1    Alice
2     Jack
3    Molly
dtype: object

In [73]:
s2

Alice    1
Jack     2
Molly    3
dtype: int64

In [75]:
s2=s1.append(s2)

In [76]:
staff=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"hari","role":"pr"},
    {"name":"sr","role":"pune"}
])
student=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"sjsjsjj","role":"prlsls"},
    {"name":"sraa","role":"klklkl"}
])
staff=staff.set_index('name')
student=student.set_index('name')
pd.merge(staff,student,how="outer",left_index=True,right_index=True)#full outer join in similiar to union

        role_x  role_y
name
gokul       hr      hr
hari        pr     NaN
sjsjsjj    NaN  prlsls
sr        pune     NaN
sraa       NaN  klklkl

In [77]:
# left join 
# always left is first and right is second

In [79]:
pd.merge(staff,student,how="left",left_index=True,right_index=True)

      role_x role_y
name
gokul     hr     hr
hari      pr    NaN
sr      pune    NaN

In [80]:
staff

       role
name
gokul    hr
hari     pr
sr     pune

In [83]:
staff=staff.reset_index()
student=student.reset_index()
pd.merge(staff,student,how="right",left_index=True,right_index=True)

   level_0_x  index_x name_x role_x  level_0_y  index_y   name_y  role_y
0          0        0  gokul     hr          0        0    gokul      hr
1          1        1   hari     pr          1        1  sjsjsjj  prlsls
2          2        2     sr   pune          2        2     sraa  klklkl

In [86]:
staff_df=pd.DataFrame([
    {"name":"gokul","role":"director of hr","location":"banglore"},
    {"name":"hari","role":"pr","location":"unknown"},
    {"name":"jz","role":"hr","location":"andhra"}
])
student_df=pd.DataFrame([
    {"name":"dheeraj","role":"buiness","location":"yelanka"},
    {"name":"hari","role":"pr","location":"unknown"},
    {"name":"jz","role":"hr","location":"andhra"}
])
student_df

      name     role location
0  dheeraj  buiness  yelanka
1     hari       pr  unknown
2       jz       hr   andhra

In [89]:
staff_df

    name            role  location
0  gokul  director of hr  banglore
1   hari              pr   unknown
2     jz              hr    andhra

In [88]:
pd.merge(staff_df,student_df,how="left",on="name")

    name          role_x location_x role_y location_y
0  gokul  director of hr   banglore    NaN        NaN
1   hari              pr    unknown     pr    unknown
2     jz              hr     andhra     hr     andhra

In [91]:
pd.merge(staff_df,student_df,how="right",on="name")

      name role_x location_x   role_y location_y
0     hari     pr    unknown       pr    unknown
1       jz     hr     andhra       hr     andhra
2  dheeraj    NaN        NaN  buiness    yelanka

In [93]:
staff_df=pd.DataFrame([
    {"name":"gokul","lastname":"js","role":"director of hr","location":"banglore"},
    {"name":"hari","lastname":"ps","role":"pr","location":"unknown"},
    {"name":"jz","lastname":"cs","role":"hr","location":"andhra"}
])
student_df=pd.DataFrame([
    {"name":"dheeraj","lastname":"ssss","role":"buiness","location":"yelanka"},
    {"name":"hari","lastname":"ps","role":"pr","location":"unknown"},
    {"name":"jz","lastname":"cs","role":"hr","location":"andhra"}
])

In [95]:
staff_df

    name lastname            role  location
0  gokul       js  director of hr  banglore
1   hari       ps              pr   unknown
2     jz       cs              hr    andhra

In [97]:
student_df

      name lastname     role location
0  dheeraj     ssss  buiness  yelanka
1     hari       ps       pr  unknown
2       jz       cs       hr   andhra

In [98]:
# _x is always the left dataframe and _y is always the right dataframe

In [104]:
pd.merge(staff_df,student_df,how='left',on=['name','lastname'])

    name lastname          role_x location_x role_y location_y
0  gokul       js  director of hr   banglore    NaN        NaN
1   hari       ps              pr    unknown     pr    unknown
2     jz       cs              hr     andhra     hr     andhra

In [105]:
# if merging is as joining "horizontally" then we joining all simliar values found in a dataframe then concatinating is joining vertically

In [110]:
%%capture
df_2011=pd.read_csv("student.csv")
df_2011.head()

In [113]:
df_2011.head()

,UNITID,OPEID,OPEID6,INSTNM,CITY,STABBR,ZIP,ACCREDAGENCY,INSTURL,NPCURL,...,OMENRUP_PARTTIME_POOLED_SUPP,FTFTPCTPELL,FTFTPCTFLOAN,UG12MN,G12MN,SCUGFFN,POOLYRS_FTFTAIDPCT,FTFTPCTPELL_POOLED_SUPP,FTFTPCTFLOAN_POOLED_SUPP,SCUGFFN_POOLED
0,100654,100200,1002,Alabama A & M University,Normal,AL,35762,Southern Association of Colleges and Schools C...,www.aamu.edu/,www.aamu.edu/admissions-aid/tuition-fees/net-p...,...,0.3193,0.7057,0.7143,5343.0,1165.0,1288.0,2.0,0.7083,0.7287,2698.0
1,100663,105200,1052,University of Alabama at Birmingham,Birmingham,AL,35294-0110,Southern Association of Colleges and Schools C...,https://www.uab.edu,https://uab.studentaidcalculator.com/survey.aspx,...,0.2475,0.3788,0.5350,14445.0,10498.0,2228.0,2.0,0.3891,0.5414,4176.0
2,100690,2503400,25034,Amridge University,Montgomery,AL,36117-3553,Southern Association of Colleges and Schools C...,www.amridgeuniversity.edu,www2.amridgeuniversity.edu:9091/,...,0.2836,1.0000,1.0000,440.0,527.0,5.0,4.0,PrivacySuppressed,PrivacySuppressed,24.0
3,100706,105500,1055,University of Alabama in Huntsville,Huntsville,AL,35899,Southern Association of Colleges and Schools C...,www.uah.edu,finaid.uah.edu/,...,0.2496,0.2707,0.4556,8145.0,2443.0,1341.0,2.0,0.2378,0.4402,2544.0
4,100724,100500,1005,Alabama State University,Montgomery,AL,36104-0271,Southern Association of Colleges and Schools C...,www.alasu.edu,www.alasu.edu/cost-aid/tuition-costs/net-price...,...,0.2621,0.7792,0.7539,4732.0,642.0,951.0,2.0,0.7684,0.7464,2094.0